BenchmarkScripts/ConcurrentClients/results/memcached_1x30gb_10cclients.txt
Results for Memcached on port 11211:
1         Threads
10        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         6765.97          ---          ---         0.13494         0.12700         0.22300         0.29500       461.78 
Gets        67659.65      4958.63     62701.02         0.13391         0.12700         0.22300         0.29500      2010.26 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      74425.63      4958.63     62701.02         0.13400         0.12700         0.22300         0.29500      2472.04 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.015        0.000
SET       0.103        5.000
SET       0.103       10.000
SET       0.111       15.000
SET       0.111       20.000
SET       0.111       25.000
SET       0.119       30.000
SET       0.119       35.000
SET       0.119       40.000
SET       0.127       45.000
SET       0.127       50.000
SET       0.127       52.500
SET       0.127       55.000
SET       0.135       57.500
SET       0.135       60.000
SET       0.143       62.500
SET       0.143       65.000
SET       0.151       67.500
SET       0.159       70.000
SET       0.159       72.500
SET       0.159       75.000
SET       0.167       76.250
SET       0.167       77.500
SET       0.167       78.750
SET       0.167       80.000
SET       0.175       81.250
SET       0.175       82.500
SET       0.175       83.750
SET       0.175       85.000
SET       0.175       86.250
SET       0.183       87.500
SET       0.183       88.125
SET       0.183       88.750
SET       0.183       89.375
SET       0.183       90.000
SET       0.183       90.625
SET       0.183       91.250
SET       0.191       91.875
SET       0.191       92.500
SET       0.191       93.125
SET       0.191       93.750
SET       0.191       94.062
SET       0.191       94.375
SET       0.191       94.688
SET       0.191       95.000
SET       0.199       95.312
SET       0.199       95.625
SET       0.199       95.938
SET       0.199       96.250
SET       0.199       96.562
SET       0.199       96.875
SET       0.199       97.031
SET       0.207       97.188
SET       0.207       97.344
SET       0.207       97.500
SET       0.207       97.656
SET       0.207       97.812
SET       0.207       97.969
SET       0.207       98.125
SET       0.207       98.281
SET       0.215       98.438
SET       0.215       98.516
SET       0.215       98.594
SET       0.215       98.672
SET       0.215       98.750
SET       0.215       98.828
SET       0.215       98.906
SET       0.223       98.984
SET       0.223       99.062
SET       0.223       99.141
SET       0.223       99.219
SET       0.223       99.258
SET       0.231       99.297
SET       0.231       99.336
SET       0.231       99.375
SET       0.231       99.414
SET       0.231       99.453
SET       0.239       99.492
SET       0.239       99.531
SET       0.239       99.570
SET       0.247       99.609
SET       0.247       99.629
SET       0.247       99.648
SET       0.247       99.668
SET       0.255       99.688
SET       0.255       99.707
SET       0.255       99.727
SET       0.255       99.746
SET       0.263       99.766
SET       0.263       99.785
SET       0.271       99.805
SET       0.271       99.814
SET       0.271       99.824
SET       0.271       99.834
SET       0.279       99.844
SET       0.279       99.854
SET       0.279       99.863
SET       0.287       99.873
SET       0.287       99.883
SET       0.295       99.893
SET       0.295       99.902
SET       0.295       99.907
SET       0.303       99.912
SET       0.303       99.917
SET       0.303       99.922
SET       0.311       99.927
SET       0.311       99.932
SET       0.319       99.937
SET       0.319       99.941
SET       0.327       99.946
SET       0.327       99.951
SET       0.335       99.954
SET       0.335       99.956
SET       0.343       99.958
SET       0.343       99.961
SET       0.351       99.963
SET       0.351       99.966
SET       0.359       99.968
SET       0.367       99.971
SET       0.375       99.973
SET       0.383       99.976
SET       0.383       99.977
SET       0.391       99.978
SET       0.399       99.979
SET       0.407       99.980
SET       0.415       99.982
SET       0.431       99.983
SET       0.447       99.984
SET       0.463       99.985
SET       0.487       99.987
SET       0.503       99.988
SET       0.511       99.988
SET       0.519       99.989
SET       0.527       99.990
SET       0.535       99.990
SET       0.551       99.991
SET       0.559       99.991
SET       0.567       99.992
SET       0.575       99.993
SET       0.591       99.993
SET       0.599       99.994
SET       0.607       99.994
SET       0.615       99.995
SET       0.615       99.995
SET       0.623       99.995
SET       0.623       99.995
SET       0.631       99.996
SET       0.639       99.996
SET       0.639       99.996
SET       0.647       99.997
SET       0.663       99.997
SET       0.671       99.997
SET       0.671       99.997
SET       0.671       99.997
SET       0.679       99.998
SET       0.679       99.998
SET       0.679       99.998
SET       0.687       99.998
SET       0.687       99.998
SET       0.695       99.998
SET       0.695       99.998
SET       0.703       99.999
SET       0.703       99.999
SET       0.703       99.999
[...]
SET       0.711       99.999
SET       0.711       99.999
SET       0.711       99.999
SET       0.719       99.999
SET       0.727       99.999
SET       0.735       99.999
SET       0.735       99.999
SET       0.735       99.999
SET       0.743       99.999
SET       0.751       99.999
SET       0.751       99.999
SET       0.759      100.000
SET       0.767      100.000
SET       0.767      100.000
SET       0.807      100.000
SET       0.831      100.000
SET       0.847      100.000
SET       0.847      100.000
SET       0.847      100.000
SET       0.855      100.000
SET       0.895      100.000
SET       0.895      100.000
SET       0.919      100.000
SET       0.943      100.000
SET       0.943      100.000
SET       0.943      100.000
SET       1.015      100.000
SET       1.015      100.000
SET       1.015      100.000
[...]
SET       1.103      100.000
SET       1.103      100.000
SET       1.231      100.000
SET       1.231      100.000
SET       1.231      100.000
[...]
SET       1.335      100.000
SET       1.335      100.000
SET       1.335      100.000
[...]
SET       2.079      100.000
SET       2.079      100.000
SET       2.079      100.000
[...]
SET       2.223      100.000
SET       2.223      100.000
---
GET       0.015        0.000
GET       0.103        5.000
GET       0.103       10.000
GET       0.111       15.000
GET       0.111       20.000
GET       0.111       25.000
GET       0.119       30.000
GET       0.119       35.000
GET       0.119       40.000
GET       0.119       45.000
GET       0.127       50.000
GET       0.127       52.500
GET       0.127       55.000
GET       0.135       57.500
GET       0.135       60.000
GET       0.135       62.500
GET       0.143       65.000
GET       0.151       67.500
GET       0.151       70.000
GET       0.159       72.500
GET       0.159       75.000
GET       0.167       76.250
GET       0.167       77.500
GET       0.167       78.750
GET       0.167       80.000
GET       0.167       81.250
GET       0.175       82.500
GET       0.175       83.750
GET       0.175       85.000
GET       0.175       86.250
GET       0.175       87.500
GET       0.183       88.125
GET       0.183       88.750
GET       0.183       89.375
GET       0.183       90.000
GET       0.183       90.625
GET       0.183       91.250
GET       0.183       91.875
GET       0.191       92.500
GET       0.191       93.125
GET       0.191       93.750
GET       0.191       94.062
GET       0.191       94.375
GET       0.191       94.688
GET       0.191       95.000
GET       0.191       95.312
GET       0.199       95.625
GET       0.199       95.938
GET       0.199       96.250
GET       0.199       96.562
GET       0.199       96.875
GET       0.199       97.031
GET       0.199       97.188
GET       0.199       97.344
GET       0.207       97.500
GET       0.207       97.656
GET       0.207       97.812
GET       0.207       97.969
GET       0.207       98.125
GET       0.207       98.281
GET       0.215       98.438
GET       0.215       98.516
GET       0.215       98.594
GET       0.215       98.672
GET       0.215       98.750
GET       0.215       98.828
GET       0.215       98.906
GET       0.215       98.984
GET       0.223       99.062
GET       0.223       99.141
GET       0.223       99.219
GET       0.223       99.258
GET       0.223       99.297
GET       0.231       99.336
GET       0.231       99.375
GET       0.231       99.414
GET       0.231       99.453
GET       0.231       99.492
GET       0.239       99.531
GET       0.239       99.570
GET       0.239       99.609
GET       0.247       99.629
GET       0.247       99.648
GET       0.247       99.668
GET       0.247       99.688
GET       0.255       99.707
GET       0.255       99.727
GET       0.255       99.746
GET       0.263       99.766
GET       0.263       99.785
GET       0.263       99.805
GET       0.271       99.814
GET       0.271       99.824
GET       0.271       99.834
GET       0.271       99.844
GET       0.279       99.854
GET       0.279       99.863
GET       0.279       99.873
GET       0.287       99.883
GET       0.287       99.893
GET       0.295       99.902
GET       0.295       99.907
GET       0.295       99.912
GET       0.303       99.917
GET       0.303       99.922
GET       0.303       99.927
GET       0.311       99.932
GET       0.311       99.937
GET       0.319       99.941
GET       0.319       99.946
GET       0.327       99.951
GET       0.327       99.954
GET       0.335       99.956
GET       0.335       99.958
GET       0.343       99.961
GET       0.343       99.963
GET       0.351       99.966
GET       0.351       99.968
GET       0.359       99.971
GET       0.367       99.973
GET       0.375       99.976
GET       0.383       99.977
GET       0.383       99.978
GET       0.391       99.979
GET       0.399       99.980
GET       0.407       99.982
GET       0.415       99.983
GET       0.431       99.984
GET       0.447       99.985
GET       0.463       99.987
GET       0.495       99.988
GET       0.503       99.988
GET       0.511       99.989
GET       0.519       99.990
GET       0.543       99.990
GET       0.551       99.991
GET       0.559       99.991
GET       0.567       99.992
GET       0.583       99.993
GET       0.599       99.993
GET       0.607       99.994
GET       0.615       99.994
GET       0.615       99.995
GET       0.623       99.995
GET       0.631       99.995
GET       0.631       99.995
GET       0.639       99.996
GET       0.639       99.996
GET       0.647       99.996
GET       0.663       99.997
GET       0.671       99.997
GET       0.671       99.997
GET       0.671       99.997
GET       0.679       99.997
GET       0.679       99.998
GET       0.687       99.998
GET       0.687       99.998
GET       0.687       99.998
GET       0.695       99.998
GET       0.695       99.998
GET       0.703       99.998
GET       0.703       99.999
GET       0.703       99.999
GET       0.711       99.999
GET       0.711       99.999
GET       0.711       99.999
GET       0.719       99.999
GET       0.727       99.999
GET       0.727       99.999
GET       0.735       99.999
GET       0.743       99.999
GET       0.751       99.999
GET       0.759       99.999
GET       0.759       99.999
GET       0.767       99.999
GET       0.775       99.999
GET       0.783       99.999
GET       0.791      100.000
GET       0.815      100.000
GET       0.839      100.000
GET       0.863      100.000
GET       0.871      100.000
GET       0.887      100.000
GET       0.887      100.000
GET       0.895      100.000
GET       0.903      100.000
GET       0.911      100.000
GET       0.951      100.000
GET       0.983      100.000
GET       1.031      100.000
GET       1.079      100.000
GET       1.111      100.000
GET       1.159      100.000
GET       1.175      100.000
GET       1.223      100.000
GET       1.263      100.000
GET       1.287      100.000
GET       1.311      100.000
GET       1.335      100.000
GET       1.391      100.000
GET       1.415      100.000
GET       1.431      100.000
GET       1.487      100.000
GET       1.487      100.000
GET       1.519      100.000
GET       1.519      100.000
GET       1.527      100.000
GET       1.551      100.000
GET       1.623      100.000
GET       1.639      100.000
GET       1.671      100.000
GET       1.711      100.000
GET       1.871      100.000
GET       1.871      100.000
GET       1.911      100.000
GET       1.951      100.000
GET       1.951      100.000
GET       1.951      100.000
[...]
GET       1.967      100.000
GET       1.967      100.000
GET       2.015      100.000
GET       2.015      100.000
GET       2.175      100.000
GET       2.175      100.000
GET       2.191      100.000
GET       2.191      100.000
GET       2.511      100.000
GET       2.511      100.000
GET       2.511      100.000
[...]
GET       2.575      100.000
GET       2.575      100.000
GET       2.575      100.000
[...]
GET       2.623      100.000
GET       2.623      100.000
GET       2.623      100.000
[...]
GET       3.039      100.000
GET       3.039      100.000
---
WAIT      0.000      100.000